app/controllers/schoolclasses_controller.rb

SELECT "schoolclasses".* FROM "schoolclasses"
---
    def index
        @schoolclasses = Schoolclass.all