app/controllers/students_controller.rb

    def update
        @student = Student.find(params[:id])
        @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Hudgen"], ["updated_at", "2020-03-17 19:14:22.002317"], ["id", 1]]